CREATE TABLE test_table (
    name        varchar(10) NOT NULL CHECK (length(name) >= 4 AND length(name) <= 10),
    surname     varchar(40) NOT NULL,
    city        varchar(40) NOT NULL,
    age         INTEGER DEFAULT 18 CHECK(Age >0 AND Age < 150)
);
INSERT INTO test_table (name, surname, city, age)
VALUES
('Александра', 'Иванова', 'Амурск', 30),
('Виктория', 'Волкова', 'Армавир', 25),
('Андрей', 'Лукьянов', 'Анапа', 40),
('Дарья', 'Андреева', 'Армавир', 35),
('Вячеслав', 'Зуев', 'Бабаево', 28),
('Мария', 'Белякова', 'Бежецк', 45),
('Марк', 'Головин', 'Бабаево', 32),
('Екатерина', 'Моисеева', 'Бежецк', 27),
('Александр', 'Сычев', 'Белорецк', 38),
('Амелия', 'Лазарева', 'Анапа', 29),
('Мария', 'Алексеева', 'Высоцк', 31),
('Кирилл', 'Сергеев', 'Калач', 42),
('Роман', 'Широков', 'Бабаево', 33),
('Билал', 'Нестеров', 'Высоцк', 41),
('Даниил', 'Семенов', 'Пермь', 26),
('Михаил', 'Демин', 'Пермь', 37),
('Софья', 'Макарова', 'Анапа', 34),
('Денис', 'Зуев', 'Калач', 43),
('Карина', 'Завьялова', 'Армавир', 36),
('Иван', 'Иванов', 'Армавир', 36);
